In [54]:
import numpy as np
import pandas as pd
from numpy.random import randn
import matplotlib.pyplot as plt
np.random.seed(101)

In [47]:
ser = pd.Series([1,2,3,4],['X','Y','Z','A'])
ser2 = pd.Series([1,2,3,5],['X','Y','Z','B'])

In [48]:
ser + ser2

A    NaN
B    NaN
X    2.0
Y    4.0
Z    6.0
dtype: float64

In [49]:
ser1 = pd.DataFrame(randn(5,4),index=['A','B','C','D','E'],columns=['U','V','W','X'])
ser3 = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['U','V','W','X'])

In [56]:
ser1['new'] = ser1['X']+ ser3['X']

In [65]:
ser1.drop('new',axis=1,inplace=True)

In [68]:
ser1.drop('E').shape

(4, 4)

In [73]:
ser1= ser1*ser1

In [74]:
ser1

            U          V          W          X
A   24.664310   0.968251  32.299023   0.000003
B   26.316087   0.613073   0.024931  10.556840
C  116.084080   9.310397  14.262909   3.000144
D    0.540422   5.746761   7.805581  26.255903
E   21.431079  86.756570  32.138534   9.317082

In [76]:
ser1.loc['A']

U    24.664310
V     0.968251
W    32.299023
X     0.000003
Name: A, dtype: float64

In [77]:
ser1.iloc[3]

U     0.540422
V     5.746761
W     7.805581
X    26.255903
Name: D, dtype: float64

In [79]:
ser1.loc['B','W']

0.024931058249232085

In [82]:
ser1.iloc[:3,[1,2]]

          V          W
A  0.968251  32.299023
B  0.613073   0.024931
C  9.310397  14.262909

In [85]:
ser1[ser1>1]

            U          V          W          X
A   24.664310        NaN  32.299023        NaN
B   26.316087        NaN        NaN  10.556840
C  116.084080   9.310397  14.262909   3.000144
D         NaN   5.746761   7.805581  26.255903
E   21.431079  86.756570  32.138534   9.317082

In [87]:
ser1[ser1['V']<1]['V']

A    0.968251
B    0.613073
Name: V, dtype: float64

In [90]:
ser1.reset_index()

  index           U          V          W          X
0     A   24.664310   0.968251  32.299023   0.000003
1     B   26.316087   0.613073   0.024931  10.556840
2     C  116.084080   9.310397  14.262909   3.000144
3     D    0.540422   5.746761   7.805581  26.255903
4     E   21.431079  86.756570  32.138534   9.317082

In [91]:
abba = 'AB CD EF GH IJ'.split()

In [98]:
ser1['States']= abba

In [100]:
ser1.set_index('States')

                 U          V          W          X
States
AB       24.664310   0.968251  32.299023   0.000003
CD       26.316087   0.613073   0.024931  10.556840
EF      116.084080   9.310397  14.262909   3.000144
GH        0.540422   5.746761   7.805581  26.255903
IJ       21.431079  86.756570  32.138534   9.317082

In [101]:
ser1

            U          V          W          X States
A   24.664310   0.968251  32.299023   0.000003     AB
B   26.316087   0.613073   0.024931  10.556840     CD
C  116.084080   9.310397  14.262909   3.000144     EF
D    0.540422   5.746761   7.805581  26.255903     GH
E   21.431079  86.756570  32.138534   9.317082     IJ

In [102]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [103]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [104]:
df

             A         B
G1 1  0.651118 -0.319318
   2 -0.848077  0.605965
   3 -2.018168  0.740122
G2 1  0.528813 -0.589001
   2  0.188695 -0.758872
   3 -0.933237  0.955057

In [107]:
df.index.names = ['Groups','nums']

                    A         B
Groups nums
G1     1     0.651118 -0.319318
       2    -0.848077  0.605965
       3    -2.018168  0.740122
G2     1     0.528813 -0.589001
       2     0.188695 -0.758872
       3    -0.933237  0.955057

In [109]:
df.loc['G2'].loc[2]['B']

-0.758872056210466

In [116]:
df.loc['G2',2]['B']

-0.758872056210466